coin_1 = int(input('Введите монетку 1 (0, 5, 10, 50): '))
coin_2 = int(input('Введите монетку 2 (0, 5, 10, 50): '))
coin_3 = int(input('Введите монетку 3 (0, 5, 10, 50): '))
coin_4 = int(input('Введите монетку 4 (0, 5, 10, 50): '))
coin_5 = int(input('Введите монетку 5 (0, 5, 10, 50): '))
coin_6 = int(input('Введите монетку 6 (0, 5, 10, 50): '))
coin_7 = int(input('Введите монетку 7 (0, 5, 10, 50): '))
coin_8 = int(input('Введите монетку 8 (0, 5, 10, 50): '))
coin_9 = int(input('Введите монетку 9 (0, 5, 10, 50): '))
coin_10 = int(input('Введите монетку 10 (0, 5, 10, 50): '))

total = coin_1 + coin_2 + coin_3 + coin_4 + coin_5 + coin_6 + coin_7 + coin_8 + coin_9 + coin_10

if total == 100:
    print('Монеток на 1 рубль')
else:
    print('Неполучилось')

