import random


def main():
    us_state_capitals_ru = {
        "Алабама": "Монтгомери",
        "Аляска": "Джунау",
        "Аризона": "Финикс",
        "Арканзас": "Литл-Рок",
        "Калифорния": "Сакраменто",
        "Колорадо": "Денвер",
        "Коннектикут": "Хартфорд",
        "Делавэр": "Довер",
        "Флорида": "Таллахасси",
        "Джорджия": "Атланта",
        "Гавайи": "Гонолулу",
        "Айдахо": "Бойсе",
        "Иллинойс": "Спрингфилд",
        "Индиана": "Индианаполис",
        "Айова": "Де-Мойн",
        "Канзас": "Топика",
        "Кентукки": "Франкфорт",
        "Луизиана": "Батон-Руж",
        "Мэн": "Огаста",
        "Мэриленд": "Аннаполис",
        "Массачусетс": "Бостон",
        "Мичиган": "Лансинг",
        "Миннесота": "Сент-Пол",
        "Миссисипи": "Джексон",
        "Миссури": "Джефферсон-Сити",
        "Монтана": "Хелена",
        "Небраска": "Линкольн",
        "Невада": "Карсон-Сити",
        "Нью-Гэмпшир": "Конкорд",
        "Нью-Джерси": "Трентон",
        "Нью-Мексико": "Санта-Фе",
        "Нью-Йорк": "Олбани",
        "Северная Каролина": "Роли",
        "Северная Дакота": "Бисмарк",
        "Огайо": "Колумбус",
        "Оклахома": "Оклахома-Сити",
        "Орегон": "Сейлем",
        "Пенсильвания": "Харрисберг",
        "Род-Айленд": "Провиденс",
        "Южная Каролина": "Колумбия",
        "Южная Дакота": "Пирр",
        "Теннесси": "Нэшвилл",
        "Техас": "Остин",
        "Юта": "Солт-Лейк-Сити",
        "Вермонт": "Монпелье",
        "Виргиния": "Ричмонд",
        "Вашингтон": "Олимпия",
        "Западная Виргиния": "Чарлстон",
        "Висконсин": "Мэдисон",
        "Вайоминг": "Шайенн",
    }

    not_right = 0
    right = 0


    for i in range(len(us_state_capitals_ru)):
        state = random.choice(list(us_state_capitals_ru.keys()))
        capitals = us_state_capitals_ru.pop(state)
        print(f'Столица штата {state}')
        answer = input('Введите название: ')
        if answer == capitals:
            right += 1
        else:
            not_right += 1

        print(f'Ответов правильно: {right}')
        print(f'Ответов не правильно: {not_right}')


if __name__ == '__main__':
    main()

