'''
 Вам нужно, чтобы пользователь программы ввел фамилию клиента.
 Напишите инструкцию, которая предлагает пользователю ввести
 эти данные и присваивает их переменной.
'''

last_name = input('Введите фамилию: ')
print('Ваша фамилия:', last_name)