# Присвоить значение переменной salary.
salary = 25000.0

# Присвоить значение переменной bonus.
bonus = 12000.0

# Рассчитать заработную плату до удержаний, сложив salary
# и bonus. Присвоить результат переменной рау.
pay = salary + bonus

# Вывести переменную рау.
print('Baшa заработная плата составляет', pay)
