# Получить три оценки и присвоить их переменным
# test1, test2 и test3.
test1 = float(input('Bвeдитe первую оценку: '))
test2 = float(input('Bвeдитe вторую оценку: '))
test3 = float(input('Bвeдитe третью оценку: '))

# Вычислить средний балл из трех оценок
# и присвоить результат переменной average.
average = (test1 + test2 + test3) / 3

# Показать переменную average.
print('Средний балл составляет:', average)