# Создать глобальную переменную.
my_value = 10

# Функция show_value печатает
# значение глобальной переменной.
def show_value():
    print(my_value)

def main():
    show_value()

if __name__ == '__main__':
    main()